<?php
$lesson = $database->query("SELECT * FROM `lessons` WHERE `id` = " . $_GET['id'])->fetch(2);
$homework = $database->query("SELECT * FROM `homeworks` WHERE `lessonId` = " . $lesson['id'])->fetchAll(2);
?>
<div class="container">
    <div class="profile">
        <h1><?= $lesson['name'] ?></h1>

        <div class="course-info">
            <div class="course-info-text">
                <div style="position: relative; padding-top: 56.25%; width: 100%">
                    <iframe
                            src="<?= $lesson['video'] ?>"
                            allow="autoplay; muted; picture-in-picture; encrypted-media;" frameborder="0"
                            allowfullscreen
                            style="position: absolute; width: 100%; height: 100%; top: 0; left: 0;"></iframe>
                </div>


                <div class="lesson-works">
                    <h3>Домашние задания</h3>


                    <div class="lesson-work">
                        <div class="how-much">
                            <svg width="17" height="17" viewBox="0 0 17 17" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                        d="M15.8398 0.969971H10C9.6875 0.969971 9.38802 1.02856 9.10156 1.14575C8.8151 1.26294 8.5612 1.41919 8.33984 1.6145C8.11849 1.41919 7.86458 1.26294 7.57812 1.14575C7.29167 1.02856 6.99219 0.969971 6.67969 0.969971H0.839844C0.605469 0.969971 0.406901 1.05135 0.244141 1.21411C0.0813802 1.37687 0 1.57544 0 1.80981V14.3098C0 14.5312 0.0813802 14.7232 0.244141 14.886C0.406901 15.0487 0.605469 15.1301 0.839844 15.1301H5.64453C5.86589 15.1301 6.07747 15.1724 6.2793 15.2571C6.48112 15.3417 6.66016 15.4622 6.81641 15.6184L7.75391 16.5559C7.75391 16.5559 7.75716 16.5592 7.76367 16.5657C7.77018 16.5722 7.77344 16.5754 7.77344 16.5754C7.8125 16.6145 7.85156 16.6471 7.89062 16.6731C7.92969 16.6991 7.97526 16.7187 8.02734 16.7317C8.06641 16.7577 8.11523 16.7773 8.17383 16.7903C8.23242 16.8033 8.28776 16.8098 8.33984 16.8098C8.39193 16.8098 8.44727 16.8033 8.50586 16.7903C8.56445 16.7773 8.61979 16.7577 8.67188 16.7317H8.65234C8.70443 16.7187 8.75 16.6991 8.78906 16.6731C8.82812 16.6471 8.86719 16.6145 8.90625 16.5754C8.90625 16.5754 8.9095 16.5722 8.91602 16.5657C8.92253 16.5592 8.92578 16.5559 8.92578 16.5559L9.86328 15.6184C10.0195 15.4752 10.1986 15.358 10.4004 15.2668C10.6022 15.1757 10.8138 15.1301 11.0352 15.1301H15.8398C16.0742 15.1301 16.2728 15.0487 16.4355 14.886C16.5983 14.7232 16.6797 14.5312 16.6797 14.3098V1.80981C16.6797 1.57544 16.5983 1.37687 16.4355 1.21411C16.2728 1.05135 16.0742 0.969971 15.8398 0.969971ZM5.64453 13.47H1.67969V2.63013H6.67969C6.90104 2.63013 7.0931 2.71151 7.25586 2.87427C7.41862 3.03703 7.5 3.2356 7.5 3.46997V14.0364C7.23958 13.8671 6.94987 13.7304 6.63086 13.6262C6.31185 13.5221 5.98307 13.47 5.64453 13.47ZM15 13.47H11.0352C10.7096 13.47 10.3874 13.5188 10.0684 13.6165C9.74935 13.7141 9.45312 13.8541 9.17969 14.0364V3.46997C9.17969 3.2356 9.26107 3.03703 9.42383 2.87427C9.58659 2.71151 9.77865 2.63013 10 2.63013H15V13.47Z"
                                        fill="#697A8D"/>
                            </svg>
                            <?php if (!empty($homework)): ?>
                                <p><?= count($homework); ?> заданий(ия)</p>
                            <?php endif; ?>
                        </div>

                        <?php
                        $uid = $_SESSION['uid'];
                        if(is_array($homework)){
                            foreach($homework as $hw){
                                $qid = $hw['questionid'];
                                break;
                            }
                            
                        }

                        if (isset($qid)) {
                            $peopleanswer = $database->query("SELECT * FROM `peoplesanswers` WHERE `user_id` = $uid AND `question_id` = $qid")->fetch(PDO::FETCH_ASSOC);
                        }
                        ?>

                        <?php if (!empty($peopleanswer)): ?>
                            <?php if ($peopleanswer['status'] == 'on_check'): ?>
                                <div class="lesson-status yellow">На проверке</div>
                            <?php elseif ($peopleanswer['status'] == 'checked'): ?>
                                <div class="lesson-status green">Проверено</div>
                                <a href="?page=answers&lessid=<?= $lesson['id'] ?>" class="go-to">К результату →</a>
                            <?php else: ?>
                                <div class="lesson-status yellow">Не решено</div>
                                <a href="?page=homework-q&lessonId=<?= $lesson['id'] ?>" class="go-to">К решению →</a>
                            <?php endif; ?>
                        <?php else: ?>
                            <div class="lesson-status yellow">Не решено</div>
                            <a href="?page=homework-q&lessonId=<?= $lesson['id'] ?>" class="go-to">К решению →</a>
                        <?php endif; ?>


                    </div>


                </div>
            </div>
            <div class="materials">
                <div class="materials-header">
                    <h3>Материалы</h3>
                    <p>2 / 2</p>
                </div>
                <div class="materials-content">
                    <div class="materials-item">
                        <svg width="21" height="25" viewBox="0 0 21 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M17.7506 24.4434H3.25065C1.91596 24.4434 0.833984 23.3614 0.833984 22.0267V2.69335C0.833984 1.35867 1.91596 0.276688 3.25065 0.276688H11.709C11.7198 0.275284 11.7308 0.275284 11.7416 0.276688H11.7489C11.7603 0.280262 11.772 0.282691 11.7839 0.283938C11.8905 0.290769 11.9957 0.311486 12.0969 0.345563H12.115H12.1331H12.1476C12.1699 0.361181 12.1909 0.378556 12.2104 0.397521C12.3421 0.456033 12.462 0.537911 12.5645 0.639188L19.8145 7.88919C19.9158 7.99164 19.9976 8.11159 20.0561 8.24323C20.067 8.26981 20.0755 8.29519 20.0839 8.32298L20.096 8.35681C20.1298 8.45758 20.1497 8.56245 20.1552 8.66856C20.1563 8.6806 20.1591 8.69241 20.1637 8.7036V8.71085C20.1657 8.71878 20.1669 8.72687 20.1673 8.73502V22.0267C20.1673 22.6676 19.9127 23.2823 19.4595 23.7355C19.0063 24.1887 18.3916 24.4434 17.7506 24.4434ZM13.4296 14.7767V20.8184H14.5655V18.3534H16.3297V17.3408H14.5655V15.7929H16.5423V14.7767H13.4296ZM8.95882 14.7767V20.8184H10.4161C11.0274 20.8484 11.6194 20.5995 12.0256 20.1417C12.4423 19.6099 12.6511 18.9445 12.6128 18.27V17.2912C12.6408 16.6238 12.4262 15.9688 12.0087 15.4473C11.6155 14.9998 11.0415 14.7534 10.4463 14.7767H8.95882ZM4.45898 14.7767V20.8184H5.59482V18.6929H6.35123C6.85634 18.7209 7.34971 18.5339 7.7094 18.1781C8.05266 17.7944 8.23069 17.2907 8.20482 16.7765C8.22724 16.2499 8.04936 15.7344 7.70698 15.3337C7.36831 14.9582 6.87939 14.7538 6.37419 14.7767H4.45898ZM11.709 2.69335V8.73502H17.7506L11.709 2.69335ZM10.4354 19.8058H10.0947V15.7929H10.5079C10.8013 15.7756 11.0835 15.9085 11.2571 16.1457C11.4342 16.5122 11.5101 16.9194 11.477 17.3251V18.3751C11.5035 18.7615 11.4197 19.1474 11.2353 19.488C11.0373 19.7192 10.7381 19.838 10.4354 19.8058ZM6.37419 17.6767H5.59361V15.7929H6.38507C6.58265 15.795 6.76525 15.8987 6.8684 16.0672C6.99917 16.283 7.0623 16.533 7.04965 16.7849C7.0648 17.0199 7.0024 17.2534 6.87203 17.4495C6.75185 17.6004 6.56688 17.6848 6.37419 17.6767Z"
                                  fill="#00B0AD"/>
                        </svg>

                        <div class="materials-item-name">
                            <p>1. Конспект.pdf</p>
                            <span>2МБ</span>
                        </div>
                    </div>
                    <div class="materials-item">
                        <svg width="18" height="24" viewBox="0 0 18 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <rect x="1.5" y="6" width="15" height="8.75" stroke="#00A9A6" stroke-width="2"
                                  stroke-linecap="round"/>
                            <path d="M1.5 2.25H9M16.5 2.25H9M9 2.25V1" stroke="#00A9A6" stroke-width="2"
                                  stroke-linecap="round"/>
                            <path d="M1.5 18.5H4M16.5 18.5H14M9 18.5V22.25M9 18.5H4M9 18.5H14M4 18.5L1.5 22.25M14 18.5L16.5 22.25"
                                  stroke="#00A9A6" stroke-width="2" stroke-linecap="round"/>
                        </svg>


                        <div class="materials-item-name">
                            <p>2. Презентация2.pptx</p>
                            <span>1МБ</span>
                        </div>
                    </div>
                </div>
            </div>

        </div>


    </div>
</div>
</div>